export function fetchCountries(name) {
    return fetch(`https://restcountries.com/v3.1/name/{name}?fields=name,capital,population,flags,languages`)
    .then(response => {
    if (!response.ok) {
      throw new Error(response.status);
    }
    return response.json();
  })
}






// v1.3 - версія имеет еще несколько полей, а также другой узел флага
// ok – логическое значение: будет true, если код HTTP-статуса в диапазоне 200-299.
// 200 (OK)	Стандартна відповідь для успішних HTTP-запитів.
// status – код статуса HTTP-запроса, например 200.

// text() – возвращает ответ как обычный текст, response. json() – преобразовывает ответ в JSON-объект, response.

// Перевірка відповіді
// Значення промісу, який повертає метод fetch(), - це об'єкт зі службовою інформацією про стан відповіді сервера.
//  Екземпляр класу Response містить різні методи і властивості.
//  Залежно від типу отримуваного контенту, використовуються різні методи для перетворення тіла відповіді у дані.

// json() - парсить дані в JSON-форматі.
// text() - парсить дані в простому текстовому форматі, наприклад .csv (табличні дані).
// blob() - парсить дані, що описують файл, наприклад, зображення, аудіо або відео.

// Метод fetch() принимает один обязательный аргумент — путь к данным, которые вы хотите получить. 
// Он возвращает promise, который разрешается в(Response) независимо от того, был ли запрос удачным. 